---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.RadialArray
source: html/f1dd684a-71a4-ceab-9d34-ff0d57244e5f.htm
---
# RadialArray Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.